# 2-й(Тяжeлый и этим крутой) способ где букву с победой мы меняем на числа "1" и "-1" и с определением суммы партий мы понимаем кто победил.  
while True:
    s = input("Распишите Буквами кто победил в каждой партии") #оставляем ввод стр что бы затем использовать методы строк
    s = ' '.join(s) # Разделяем все элементы строки пробелом
    s = s.replace('A', '1').replace('D', '-1') # меняем 'A' на '1' и 'D' на '-1' Когда побеждает один игрок число отдаляется от нуля
    # с приставкой минус, а когда другой то отдаляется с приставкой плюс.
    l = list(map(int,s.split())) #используем такой вид записи что бы в списке у нас были тип int , а не str
    lsum = sum(l) #Cуммируем наш лист.
    if lsum > 0:  # Если сумма натуральное число значит победил один игрок(Anton)
        print("Anton")
    elif lsum < 0: # Если сумма отрицательное число значит победил другой игрок(Danik)
        print("Danik")
    else: # Если сумма это ноль значит ребята победили одинаковое число раз и выводим ничию. 
        print('Friendship')
